
/* 1. დაწერეთ შემდეგი სკრიპტი:

მოცემულია ცვლადი, რომლის მნიშვნელობაა 100.

დაწერეთ if პირობა, თუ ცვლადის მნიშვნელობა ნაკლებია 50ზე დაუბეჭდოს - ნაკლებია 50ზე, 
თუ ცვლადის მნიშვნელობა მეტია 20ზე დაიბეჭდოს მეტია 20ზე, 
ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - შეცდომა. */



/* 2.მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. 

ახალი if ის სინტაქსით დაწერეთ, თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; */




/* 3. მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. 
switch case ის საშუალებით დაწერეთ, თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; */




// 4. ციკლის საშუალებით გამოიტანეთ რიცხვები 5დან - 100მდე.





/*  5. მოცემულია მასივი:
let array1= [1, 2, 4, -. 1, -3, 8, 7, 0, -5, 18, 12];
ციკლის საშუალებით გამოიტანეთ მხოლოდ ის რიცხვები რომლებიც მეტია 0 ზე და ნაკლებია 10ზე. */





/*  6. მოცემულია ობიექტი:

let user2 = {
name: "anna",
age: 20,
studentStatus: "active"
}

1. თუ უსერის ასაკი ნაკლებია 18ზე და სტუდენტის სტატუსი აქტიურია დაიბეჭდოს ტექსტი:  hello user;
2. თუ უსერის სახელი უდრის ლევანს მაშინ დაიბეჭდოს ტექსტი: hello levani;
3. თუ უსერის სტუდენტის სტატუსი აქტიურია ან უსერის ასაკი ნაკლებია 25ზე დაიბეჭდოს ტექსტი: hello anna;
4. ყველა დანარჩენ შემთხვევაში დაილოგოს ტექსტი: error;

ეს ამოცანა უდნა შეასრულოთ ორივე if- ის ჩანაწერით; */




/* 7. მოცემულია მასივი:

let array6 = [ 2, 3, 5, 10,25,24,11, 100 , 6,7, 10 ]
ამოიღეთ მხოლოდ ლუწი რიცხვები. */




/* 8. მოცემულია მასივი: 

let users = [

{ userName: "giorgi", status: false}, 
{ userName: "levani", status: false}, 
{ userName: "anna", status: true}

]

კონსოლში გამოიტანეთ მარტო ის ობიექტი, რომლის status property-ის მნიშვნელობა არის true; */







